[
  {
    "id": 1,
    "title": "Hamburger",
    "description": "Thick or thin, made on the grill or stovetop, this is the best and easiest all-purpose recipe for perfect hamburger patties every time",
    "image": "hamburger.jpg",
    "ingredients": [
      "1 pound lean ground beef",
      "1 large egg",
      "1/2 cup minced onion",
      "1/4 cup fine dried bread crumbs",
      "1 tablespoon Worcestershire",
      "1 or 2 cloves garlic, peeled and minced",
      "1/2 teaspoon salt",
      "1/4 teaspoon pepper",
      "4 hamburger buns",
      "1/4 cup mayonnaise",
      "1/4 cup ketchup",
      "4 iceberg lettuce leaves, rinsed and crisped",
      "1 firm-ripe tomato, cored and thinly sliced",
      "4 thin slices red onion"
    ],
    "steps": [
      "In a bowl, mix ground beef, egg, onion, bread crumbs, Worcestershire, garlic, 1/2 teaspoon salt, and 1/4 teaspoon pepper until well blended. Divide mixture into four equal portions and shape each into a patty about 4 inches wide.",
      "Lay burgers on an oiled barbecue grill over a solid bed of hot coals or high heat on a gas grill (you can hold your hand at grill level only 2 to 3 seconds); close lid on gas grill. Cook burgers, turning once, until browned on both sides and no longer pink inside (cut to test), 7 to 8 minutes total. Remove from grill.",
      "Lay buns, cut side down, on grill and cook until lightly toasted, 30 seconds to 1 minute.",
      "Spread mayonnaise and ketchup on bun bottoms. Add lettuce, tomato, burger, onion, and salt and pepper to taste. Set bun tops in place."
    ]
  },
  {
    "id": 2,
    "title": "Lasagna",
    "description": "An easy lasagna recipe that saves me lots of time. This dish satisfies everyone in the family. Try it tonight!",
    "image": "lasagna.jpeg",
    "ingredients": [
      "1 pound lean ground beef",
      "1 jar spaghetti sauce",
      "3 cups shredded mozzarella cheese",
      "2 eggs",
      "1/2 cup grated parmesan cheese",
      "2 teaspoons dried parsley",
      "salt to taste",
      "ground black pepper",
      "9 lasagna noodles",
      "1/2 cup water"
    ],
    "steps": [
      "Preheat the oven to 350 degrees F",
      "Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 8 to 10 minutes. Drain and discard grease. Stir in spaghetti sauce and simmer for 5 minutes.",
      "Combine cottage cheese, 2 cups of mozzarella cheese, eggs, 1/2 of the grated Parmesan cheese, dried parsley, salt, and pepper in a large bowl.",
      "Spread 3/4 cup of sauce in a 9x13-inch baking dish. Cover with 3 uncooked lasagna noodles, 1 3/4 cups of cheese mixture, and 1/4 cup sauce; repeat layers once more. Top with remaining 3 noodles, sauce, mozzarella, and Parmesan cheese. Pour 1/2 cup water along the edges of the dish. Cover tightly with aluminum foil.",
      "Bake in the preheated oven for 45 minutes. Uncover and bake for an additional 10 minutes. Let stand 10 minutes before serving."
    ]
  },
  {
    "id": 3,
    "title": "Spaghetti Bolognese",
    "description": "The secret ingredient in this ultrafast sauce based on long-cooking Bolognese is Worcestershire sauce. -Dawn Perry",
    "image": "spaghetbolog.jpg",
    "ingredients":[
      "Kosher Salt and black pepper",
      "2 tablespoons olive oil",
      "1 medium yellow onion, finely chopped",
      "2 cloves garlic, finely chopped",
      "1/2 pound ground beef",
      "12 ounces spaghetti",
      "1/2 cup tomato paste",
      "2 teaspoons Worcestershire sauce",
      "Grated Parmesan"
    ],
    "steps":[
      "Bring a large pot of salted water to a boil. Heat oil in a large skillet over medium-high. Add onion, garlic and ½ teaspoon salt and cook, stirring often, until beginning to soften, 3 minutes. Add beef and cook, breaking up with a wooden spoon, until no longer pink, about 3 minutes.",
      "Add pasta to the pot and cook according to package instructions until al dente.",
      "Meanwhile, add tomato paste to skillet and cook, stirring, until darkened, about 1 minute. Add 1 cup water, Worcestershire, ½ teaspoon pepper and ½ teaspoon salt and simmer until slightly reduced, about 5 minutes.",
      "Using tongs, transfer pasta directly from the pot to the skillet along with 1 cup pasta water. Increase heat to high and simmer vigorously, tossing, until sauce reduces and coats the pasta, about 2 minutes. Season to taste with salt and pepper. Serve with Parmesan."
    ]
  },
  {
    "id": 4,
    "title": "Sushi Vinegar",
    "description": "This is a recipe for 1 cup of sushi vinegar. You can use this vinegar to season 3 cups of sushi rice. Quantities can be adjusted proportionally.",
    "image": "sushi-vinegar.jpg",
    "ingredients": [
      "1/3 cup sugar",
      "2/3 cup rice vinegar",
      "1 tablespoon of salt"   
    ],
    "steps": [
      "Combine the sugar, rice vinegar, and salt in a small saucepan.",
      "Heat the mixture over low heat, stirring occasionally, until the sugar and salt have dissolved.",
      "Remove the saucepan from the heat and let the vinegar cool to room temperature before using it to season sushi rice."
    ]
  },
  {
    "id": 5,
    "title": "Egg Sandwich",
    "description": "This is a simple and delicious egg sandwich recipe that is perfect for breakfast or lunch. It's quick and easy to make, and you can customize it with your favorite ingredients.",
    "image": "egg-sandwich.jpg",
    "ingredients": [
      "2 large eggs",
      "2 slices of bread",
      "1 tablespoon of butter",
      "Salt and pepper to taste",
      "Optional: cheese, bacon, ham, avocado, tomato, lettuce, or any other toppings you like"
    ],
    "steps": [
      "In a small bowl, beat the eggs with a fork until well mixed. Season with salt and pepper to taste.",
      "Heat a non-stick skillet over medium heat and add the butter. Once the butter has melted, pour in the beaten eggs.",
      "Cook the eggs, stirring occasionally, until they are scrambled and cooked through. Remove from heat.",
      "Toast the bread slices until golden brown. Place the scrambled eggs on one slice of bread and top with your favorite toppings. Place the other slice of bread on top to make a sandwich.",
      "Cut the sandwich in half and serve immediately. Enjoy!"
    ]
  },
  {
    "id": 6,
    "title": "Tuna Salad",
    "description": "This classic tuna salad recipe is quick and easy to make, and perfect for a light and healthy meal. It's great for sandwiches, salads, or as a dip with crackers or veggies.",
    "image": "tuna-salad.jpg",
    "ingredients": [
      "2 cans of tuna, drained",
      "1/2 cup of mayonnaise",
      "1/4 cup of chopped celery",
      "1/4 cup of chopped red onion",
      "1 tablespoon of lemon juice",
      "1 teaspoon of dijon mustard",
      "Salt and pepper to taste",
      "Optional: chopped pickles, capers, or fresh herbs"
    ],
    "steps": [
      "In a medium bowl, combine the drained tuna, mayonnaise, celery, red onion, lemon juice, dijon mustard, salt, and pepper. Mix well to combine.",
      "Taste the tuna salad and adjust the seasoning as needed. Add more mayonnaise, lemon juice, mustard, salt, or pepper to taste.",
      "If desired, stir in chopped pickles, capers, or fresh herbs for extra flavor and texture.",
      "Serve the tuna salad on bread for sandwiches, on a bed of lettuce for a salad, or as a dip with crackers or veggies. Enjoy!"
    ]
  }
]
